Ran Plan for dir: `terraform/applications/noteburst` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis/bin/terraform1.11.4 plan -input=false -refresh -out "/atlantis/repos/lsst-sqre/prodromos/6/default/terraform/applications/noteburst/default.tfplan"' in '/atlantis/repos/lsst-sqre/prodromos/6/default/terraform/applications/noteburst': exit status 1
module.new_unresolved_alert["usdfdev"].module.environment.terraform_data.environment: Refreshing state... [id=6d5426bf-38b1-024a-103b-ae8fdf9a937a]
module.new_unresolved_alert["idfprod"].module.environment.terraform_data.environment: Refreshing state... [id=4eabbb96-3777-6d43-ba63-a077cd3f3923]
module.new_unresolved_alert["usdfint"].module.environment.terraform_data.environment: Refreshing state... [id=d3fd67c9-461f-3e51-aecb-0020b141ead2]
module.new_unresolved_alert["usdfprod"].module.environment.terraform_data.environment: Refreshing state... [id=fa6054b9-423a-c9c1-9369-c64c3657b39a]
module.new_unresolved_alert["idfint"].module.environment.terraform_data.environment: Refreshing state... [id=f49f901f-e1e4-029f-0942-3a6fb0f76b6e]
module.new_unresolved_alert["idfdev"].module.environment.terraform_data.environment: Refreshing state... [id=b3724407-facd-48af-0048-97d0b119a670]
module.org.data.sentry_organization.rubin: Reading...
module.new_unresolved_alert["idfprod"].sentry_issue_alert.alert: Refreshing state... [id=15904588]
module.new_unresolved_alert["idfdev"].sentry_issue_alert.alert: Refreshing state... [id=15904590]
module.new_unresolved_alert["idfint"].sentry_issue_alert.alert: Refreshing state... [id=15904586]
module.new_unresolved_alert["usdfdev"].sentry_issue_alert.alert: Refreshing state... [id=15904589]
module.new_unresolved_alert["usdfint"].sentry_issue_alert.alert: Refreshing state... [id=15904591]
module.new_unresolved_alert["usdfprod"].sentry_issue_alert.alert: Refreshing state... [id=15904587]
module.org.data.sentry_organization.rubin: Read complete after 1s [id=rubin-observatory]
module.org.data.sentry_team.square: Reading...
module.org.data.sentry_team.square: Read complete after 0s [id=square]
sentry_project.project: Refreshing state... [id=noteburst]
module.alert_renotify["usdfdev"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfprod"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfdev"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfprod"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfint"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfint"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfdev"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["usdfdev"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["usdfprod"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["idfprod"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["idfint"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["usdfint"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert_renotify["idfdev"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["usdfint"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfprod"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["usdfint"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["idfdev"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfdev"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["usdfprod"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfprod"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["idfint"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfint"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfprod"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfdev"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.alert_renotify["idfdev"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-dev-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfdev"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfdev"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfint"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-int-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfint"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfint"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfprod"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfprod"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfprod"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfdev"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-dev"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfdev"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfdev"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfint"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-int"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfint"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfint"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfprod"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfprod"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfprod"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfdev"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfdev",
        ]
    }

  # module.alert_renotify["idfint"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfint",
        ]
    }

  # module.alert_renotify["idfprod"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfprod",
        ]
    }

  # module.alert_renotify["usdfdev"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfdev",
        ]
    }

  # module.alert_renotify["usdfint"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfint",
        ]
    }

  # module.alert_renotify["usdfprod"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfprod",
        ]
    }

  # module.new_unresolved_alert["idfdev"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
  - resource "terraform_data" "environment" {
      - id     = "b3724407-facd-48af-0048-97d0b119a670" -> null
      - input  = "idfdev" -> null
      - output = "idfdev" -> null
    }

  # module.new_unresolved_alert["idfint"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
  - resource "terraform_data" "environment" {
      - id     = "f49f901f-e1e4-029f-0942-3a6fb0f76b6e" -> null
      - input  = "idfint" -> null
      - output = "idfint" -> null
    }

  # module.new_unresolved_alert["idfprod"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
  - resource "terraform_data" "environment" {
      - id     = "4eabbb96-3777-6d43-ba63-a077cd3f3923" -> null
      - input  = "idfprod" -> null
      - output = "idfprod" -> null
    }

  # module.new_unresolved_alert["usdfdev"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
  - resource "terraform_data" "environment" {
      - id     = "6d5426bf-38b1-024a-103b-ae8fdf9a937a" -> null
      - input  = "usdfdev" -> null
      - output = "usdfdev" -> null
    }

  # module.new_unresolved_alert["usdfint"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
  - resource "terraform_data" "environment" {
      - id     = "d3fd67c9-461f-3e51-aecb-0020b141ead2" -> null
      - input  = "usdfint" -> null
      - output = "usdfint" -> null
    }

  # module.new_unresolved_alert["usdfprod"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
  - resource "terraform_data" "environment" {
      - id     = "fa6054b9-423a-c9c1-9369-c64c3657b39a" -> null
      - input  = "usdfprod" -> null
      - output = "usdfprod" -> null
    }

Plan: 12 to add, 0 to change, 6 to destroy.
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵


```
</details>